app/views/post/_post_edit.html.erb

<p>
<% Category.find( :all, :order => 'name asc' ).each do |catg| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]