app/views/post/index.html.erb

  </tr>
  <% Post.order( 'release_date DESC, id DESC' ).each do |post| %>
---
SELECT "posts".* FROM "posts" ORDER BY release_date DESC, id DESC