app/controllers/category_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 18 Jan 2013 02:40:11 UTC +00:00], ["name", "asdf"], ["updated_at", Fri, 18 Jan 2013 02:40:11 UTC +00:00]]
---
  def create
    newCat = Category.new
    newCat.name = params[:name]
    unless newCat.save

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]
---
  def delete
    Category.destroy( params[:category_id] )

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def rename
    category = Category.find( params[:category_id] )