app/controllers/category_viewer_controller.rb

  def view
    category = Category.find_by_name( params[:name] )

    if category.nil?
      raise ActionController::RoutingError.new( 'Not Found' )
      return
    end

    @category = params[:name]
    @posts = category.posts.where( :hidden => 0 ).order( 'release_date DESC' )
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'security' LIMIT 1
SELECT "posts".* FROM "posts" INNER JOIN "categories_posts" ON "posts"."id" = "categories_posts"."post_id" WHERE "categories_posts"."category_id" = 3 AND "posts"."hidden" = 0 ORDER BY release_date DESC