app/controllers/post_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "15"]]
SELECT "categories".* FROM "categories" INNER JOIN "categories_posts" ON "categories"."id" = "categories_posts"."category_id" WHERE "categories_posts"."post_id" = 15
---
  def edit
    @post = Post.find( params[:id] )
    @selected_categories = @post.categories.map { |x| x.id }

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def delete
    Post.destroy( params[:id] )

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "15"]]
SELECT "categories".* FROM "categories" ORDER BY name asc
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "posts" ("body", "created_at", "hidden", "hits", "modify_date", "release_date", "title", "updated_at", "url_title") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "posts" SET "body" = 'the edited!!!', "release_date" = '2013-01-19 18:43:14.864054', "modify_date" = '2013-01-19 18:43:14.864387', "updated_at" = '2013-01-19 18:43:14.866676' WHERE "posts"."id" = 15
---
  def save
    if params[:id]
      post = Post.find( params[:id] )
      toRender = :edit
    else
      post = Post.new
      post.hits = 0
      toRender = :new
    end

    post.title = params[:title]
    post.url_title = params[:url_title]
    post.body = params[:body]
    post.modify_date = Time.now.to_date
    post.release_date = Date.parse( params[:published] )
    if params["preview"]
      post.hidden = 1
    elsif post.new_record?
      post.hidden = 0
    end

    @selected_categories = []
    if params[:categories]
      @selected_categories = params[:categories].map { |x| x.to_i }
      post.categories.clear
      params[:categories].each do |catid|
        catg = Category.find(catid.to_i)
        next if catg.nil?
        post.categories << catg
      end
    end

    post.save!

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "posts" SET "hidden" = 't', "updated_at" = '2013-01-19 21:17:09.765925' WHERE "posts"."id" = 6
---
  def hide
    post = Post.find( params[:id] )
    post.hidden = 1
    post.save!

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "posts" SET "hidden" = 'f', "updated_at" = '2013-01-19 21:17:11.376260' WHERE "posts"."id" = 6
---
  def unhide
    post = Post.find( params[:id] )
    post.hidden = 0
    post.save!

SELECT "posts".* FROM "posts" WHERE "posts"."url_title" = 'asdfsdff23f23' LIMIT 1
---
  def preview
    @post_show = Post.find_by_url_title( params[:url_title] )