app/controllers/post_viewer_controller.rb

  def latest
    @post_show = Post.latest
    if @post_show.nil?
      redirect_to :controller => "user", :action => "login"
      return
    end
    @post_show.hits += 1
    @post_show.save!
---
SELECT "posts".* FROM "posts" WHERE ((release_date < '2013-01-21 07:00:00.000000') OR (release_date = '2013-01-21 07:00:00.000000' AND id < 7)) ORDER BY release_date DESC, id DESC LIMIT 1
UPDATE "posts" SET "hits" = 1, "updated_at" = '2013-01-20 00:58:56.448258' WHERE "posts"."id" = 14

  def view
    @post_show = Post.find_by_url_title( params[:url_title] )
    if @post_show.nil?
      raise ActionController::RoutingError.new('Not Found')
    end
    if @post_show.hidden == 1
      raise ActionController::RoutingError.new('Not Found')
    end
    @post_show.hits += 1
    @post_show.save!
---
SELECT "posts".* FROM "posts" WHERE "posts"."url_title" = 'admin' LIMIT 1
UPDATE "posts" SET "hits" = 1, "updated_at" = '2013-01-20 01:05:35.288014' WHERE "posts"."id" = 17

  def wp_redirect
    post = Post.find_by_url_title( params[:url_title] )
---
SELECT "posts".* FROM "posts" WHERE "posts"."url_title" = 'first-phile' LIMIT 1