app/controllers/user_controller.rb

  def authenticate
    user = User.find_by_name( params[:name].downcase )
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'asdf' LIMIT 1

  def settings
    user = User.find( session[:user_id] )
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def save_settings
    user = User.find( session[:user_id] )

    unless user
      redirect_to :action => "login"
      return
    end

    if user.authenticate( params[:old] )
      if params[:new] == params[:new_confirm]
        user.password = params[:new]
        if user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = '$2a$10$fAPDss6GTdzufGSRcoScHu.zsThQ4bzSnu72npGiVEmkHd.h4g9lm', "updated_at" = '2013-01-20 18:20:11.878308' WHERE "users"."id" = 1